Revit 2027 API
IFCFamilyInstanceExtrusionExportResults.GetCutPairOpenings Method
 Gets the set of "openings" determined from the analysis of the instance geometry.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IFCExtrusionData> GetCutPairOpenings()
Public Function GetCutPairOpenings As IList(Of IFCExtrusionData)
public:
IList<IFCExtrusionData^>^ GetCutPairOpenings()
member GetCutPairOpenings : unit -> IList<IFCExtrusionData>
Return Value
IList<IFCExtrusionData>
 The extra openings.
See Also
Reference
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace